
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"6238dc96cb3ecd19a9ce2c93f145d0f0f0e04b209e093089afaab9dfe892cbe0\"" -> "W/\"dce4db16330ab773c4cdf3ca3ff728779a20f1afe97c88e08176e68aa045a2e0\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"4d87e96f1cfd699b268776cde477164a34762e099f8de1a114ea440d419df5ac\"" -> "W/\"706b1c7fe4761c7ffa339d7eebec2648e8c765243d958ba659b6cd6ae4d32049\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"c362223589c3e88b3dc97ef50de9d20661b3ee64b523607df562631105392f47\"" -> "W/\"2e615fa730b01f956bc2076e56c6ed2617d04713f54a85377c02ce8598e58d13\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"0a81b17e52c70d1cdb377263980f0b8d156560d7b070d5fa9b94e4eb5e25818f\"" -> "W/\"1ffef81a6293391bce60e17218212b62b1401e13243d527c4c6932d33a880bb0\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"f03de5e1164f7541e9edac1ba0bad7dfa02ea4f39e6103422520785030dd8cf0\"" -> "W/\"c696f4e0149fd880b7a89f25d2e7d96c87b87155c189e894908aa16e2fab87fe\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"26e137bb4f00e3c0eff94ff1eee505686ba20ceaa33810201f0807819cad796b\"" -> "W/\"5c3175f9ddd25263788d51456aa147ed53040ccd2b07e7b8f9c4485e1b6b5def\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"0b6e1725fa1fb9927f90bfb485996d38b7d1021c2ea5701823c95ca6fc9a1a04\"" -> "W/\"94af55fdb4dc251f92b4a3a3e27f964fda8e056f3e2f1ca390e446436e95d88a\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"d85f6ed0a4ac716450f63925302a96eac1ab31a8f9c60e33abc3e57a01a40255\"" -> "W/\"0d8cf0692631b2171e5906e4a4012b4347d537ebabdc59c1f5fd61616653cac7\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"4d742b3eacfb054de946a3c7ee33fe95c6f0af202b80d76a6f7d5de409d9cdcb\"" -> "W/\"d265079ce3fb0fc5263e24d8a4b1bd92ec198e7c08099d38acf682103b0b1e88\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"0b3c586883a6821e9fae6aee011c0479cd78572aba5762491e9c1813415a5719\"" -> "W/\"8390e6ac5c32795d816afa8cc0a1355f84a98f0bff815b2da03d8aa96a8ce06d\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"9d7bd5b62bd541f02f307a2cd82892b5582eeef4b0f3d6632559d83ea3b117c5\"" -> "W/\"77d5a31802296f75ada4a1fcc4fb4169040876a3622a6d76eb2e7680d94189eb\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"d399455e4c844902fa4194f4f0f3ea86cc6d54a4a8fdfb10852c249f84588e7e\"" -> "W/\"9b70aeb96377d49cc4a97ec5aa16620cbb1114486b8317b08e7ba72babd8828e\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"a860bf48c1d70c447a7cd9b1fa46eaf3d95342a3a4ed72598f1484d0faf95dc5\"" -> "W/\"7463d2c99186efbe2f1e005f87cb963ad3ef6d1f4f22ba8f637993181d0f7dfd\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7d7f97207cce6b0b55c2870f4c9806da1a2ff491842a46afde65313ec4a058c5\"" -> "W/\"19acd806e21f3acfc28de64df80e133873e1a53a1f60157b54a1b6623e3517de\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e880782d46410400a0948fd06cb9b02d074d87557ebb4e47c2c8184b65356020\"" -> "W/\"d5f8f7e9c9379df69b944faef6598af6acf2f456fddde9c37ca472d1dc85e87e\""
        id          = "1482348"
        name        = "protect-main-branch-kong-test-suite-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"2c72085ffbf0b90b4966f3afa1fac2c46fb5fc87c4c796f56b19a20362b769e6\"" -> "W/\"4e8b249c7cf903dd76e30c993d5f52d842b9315d293a77a20dcec45d5e6bf4e5\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"41676ccadb523bda3ce4d2c58d7e2beffe8d7442ca2178ec2de2361b5d384b28\"" -> "W/\"ee8924528fe8510fc85e8dfde964960f4c2a6ab3b667adfe5b5c0e16428454e8\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"76e82ffc400d1221d9c37bfe9c3879ac01b593c3b564578aeb9945fcf2ad6b6b\"" -> "W/\"9fe13c2875fd8175a7e775921087fde01620efc175a1f5fa50dbb276ce4bfb1f\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"65a7f00d14f0bce8e0da6ddb988ca70662d12af7ec22ddd1e5daba15e9595d0d\"" -> "W/\"7909d2a5d52d21a9b2f3e6287a892d408a4bd99767bd6f4b7a1ee23f682b0a08\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"cbc57f3522404ef29c86f14eaa44b033791b3c3ac16b5286be973dd50b869d20\"" -> "W/\"67cfb5e32fce2077c4c8247f44dbdbdcc1645d98c4dd42b67d094143fb82ad2e\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"7743382bd541a5b756cf2bdd6d01de1a10e0e98c7b8e85b0333f3d3fae2713d8\"" -> "W/\"f667e9b2901e58dca9ca88a2d4e3766eb577c6694601b832b4badccc22b4793f\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"e6ae3f6010b4f0c2609ac28b2b77083f74554426d53e49f15aa1b3fa0117561e\"" -> "W/\"d2c127f3988f4b64cf66437d7344de9413df4bf7ea38cd87ab4dbb6a5c77865c\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"2994f076d272c28282429a75292ac1bf900b149a93c8d41f00316453da2ca610\"" -> "W/\"196955ad756a5fbdc51c709968516c45d5735ee5c2d3fb75080965b371549f28\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"811cf97178b78260483c5975c73ea25cc474444cd888a529b254338172c6e367\"" -> "W/\"443ce3b1da3375e71d3a7899ce0f85e50dc884cd57e3f331050cea653321be6f\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"e221c819a02435a19abd30ccc90c0c2769d5593758761bfbdcc06351dd311866\"" -> "W/\"feeadc8bf7ffc42f5c398de7f87ef14f9e1f649a3ca982159672c7a0f28f6fb2\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"3da960c60e1724c44ea9a1173537dcaf7f46761432b502ef6002fbab4250de43\"" -> "W/\"b5978763fcd013e3fc4804d4d647d0b6245db2887f4f67d0b65ae4caa5e12415\""
        id          = "1482346"
        name        = "protect-main-branch-kong-test-suite-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"0a347a49bc92283cca3e33000d630549e72ab9f7c477094e377b8872f3830dd5\"" -> "W/\"2210c1968868aaebf18a2384ec197be8d0a7876d6fc92b59f22d08690087b969\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"0acef5fe6085757c9d207316f1bbcd037ee8d31e6825533e8ce6dbca587c0210\"" -> "W/\"884e15262d994e5abdafb015d791fbecc69537e38187740a8fdbf601dc2fd64b\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"b6bb9d5d4e431901efa6c73ed50d65be4ffdc3725e41d47f554bd3d74a972838\"" -> "W/\"54df801b4c2eced80457ab1f3054201444cdda79d425a0d0ad094ad556fb2d31\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"a03c530df7d7f2e5818eb111865dac5a4830ca12ad552cc31a2a7667a0a45796\"" -> "W/\"cfe411df464b8ce4f02bb52ef9eee7852a950e64e31ca1cd4a39d8ed8e76efc9\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240822-070846"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_all["kong-docker"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-docker"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1482348"
      ~ name        = "protect-main-branch-kong-test-suite-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1482346"
      ~ name        = "protect-main-branch-kong-test-suite-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240822-070846" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 22 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->